app/views/museums/show.html.erb

SELECT "paintings".* FROM "paintings" WHERE "paintings"."museum_id" = ?  [["museum_id", 1]]
---

<% @museum.paintings.each do |painting| %>