app/controllers/paintings_controller.rb

SELECT "paintings".* FROM "paintings" WHERE (title LIKE '%yoyoyo%')
SELECT  "paintings".* FROM "paintings"  ORDER BY "paintings"."id" ASC LIMIT 5
---
	def index
		if params[:q]
			@paintings = Painting.search(params[:q])
		else
			@paintings = Painting.first(5)